In [1]:
%%capture
%load_ext sql

In [5]:
%sql sqlite:///factbook.db

'Connected: @factbook.db'

In [21]:
%%sql
SELECT *
FROM sqlite_master
WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [22]:
%%sql
SELECT *
FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [29]:
%%sql
SELECT MIN(population) AS min_pop, MAX(population) AS max_pop, MIN(population_growth) AS min_growth, MAX(population_growth) AS max_growth
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [32]:
%%sql
SELECT name, population
FROM facts
WHERE population = (SELECT MIN(population) FROM facts);

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

In [33]:
%%sql
SELECT name, population
FROM facts
WHERE population = (SELECT MAX(population) FROM facts);

 * sqlite:///factbook.db
Done.

[('World', 7256490011)]

In [37]:
%%sql
SELECT MIN(population) AS min_pop, MAX(population) AS max_pop, MIN(population_growth) AS min_growth, MAX(population_growth) AS max_growth
FROM facts
WHERE population < (SELECT MAX(population) FROM facts);

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [55]:
%%sql
SELECT AVG(CAST(population AS INTEGER
               )) AS avg_pop FROM facts
WHERE population IS NOT (SELECT MAX(population) FROM facts);

 * sqlite:///factbook.db
Done.

[(32242666.56846473,)]

In [56]:
%%sql
SELECT AVG(CAST(area AS INTEGER
               )) AS avg_area FROM facts
WHERE population IS NOT (SELECT MAX(population) FROM facts);

 * sqlite:///factbook.db
Done.

[(555093.546184739,)]

In [68]:
%%sql

SELECT name, population, area
FROM facts
WHERE population > (SELECT AVG(population) 
                    FROM facts 
                    WHERE population IS NOT (
                        SELECT MAX(population)
                        FROM facts)
                   ) 
AND area < (SELECT AVG(area)
            FROM facts
            WHERE population IS NOT (
                SELECT MAX(population)
                FROM facts)
           )

 * sqlite:///factbook.db
Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Iraq', 37056169, 438317),
 ('Italy', 61855120, 301340),
 ('Japan', 126919659, 377915),
 ('Korea, South', 49115196, 99720),
 ('Morocco', 33322699, 446550),
 ('Philippines', 100998376, 300000),
 ('Poland', 38562189, 312685),
 ('Spain', 48146134, 505370),
 ('Thailand', 67976405, 513120),
 ('Uganda', 37101745, 241038),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]